RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v2.c
/***************************************************************************//**
* \file cy_capsense_sensing_v2.c
* \version 3.0
*
* \brief
* This file contains the source of functions common for different sensing
* methods.
*
********************************************************************************
* \copyright
* Copyright 2018-2021, Cypress Semiconductor Corporation (an Infineon company)
* or an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include <stdlib.h>
#include <stddef.h>
#include "cy_gpio.h"
#include "cy_sysclk.h"

#include "cycfg_capsense_defines.h"
#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing_v2.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_csx_v2.h"
#include "cy_capsense_csd_v2.h"
#include "cy_capsense_lib.h"
#include "cy_capsense_selftest.h"
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    #include "cy_csd.h"
#endif

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2))


/*******************************************************************************
* Constants
*******************************************************************************/
#define CY_CAPSENSE_AUTOTUNE_CALIBRATION_RESOLUTION             (12u)
#define CY_CAPSENSE_AUTOTUNE_CALIBRATION_FREQ_KHZ               (1500u)
#define CY_CAPSENSE_CSD_SNS_FREQ_KHZ_MAX                        (6000u)
#define CY_CAPSENSE_CSD_AUTOTUNE_CAL_UNITS                      (1000u)
#define CY_CAPSENSE_AUTOTUNE_CP_MAX                             (69000Lu)

#define CY_CAPSENSE_EXT_CAP_DISCHARGE_TIME                      (1u)

#define CY_CAPSENSE_VREF_GAIN_MAX                               (32u)
#define CY_CAPSENSE_VREF_VDDA_MIN_DIFF                          (600u)
#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    #define CY_CAPSENSE_VREF_SRSS_MV                            (1200u)
#else
    #define CY_CAPSENSE_VREF_SRSS_MV                            (800u)
#endif
#define CY_CAPSENSE_VREF_PASS_MV                                (1200u)

#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    #define CY_CAPSENSE_VREF_RANGE_0                            (4700u)
    #define CY_CAPSENSE_VREF_RANGE_1                            (3200u)
    #define CY_CAPSENSE_VREF_RANGE_2                            (2600u)
    #define CY_CAPSENSE_VREF_VALUE_0                            (2743u)
    #define CY_CAPSENSE_VREF_VALUE_1                            (2021u)
    #define CY_CAPSENSE_VREF_VALUE_2                            (1477u)
    #define CY_CAPSENSE_VREF_VALUE_MIN                          (1200u)
#else
    #define CY_CAPSENSE_VREF_RANGE_0                            (2750u)
    #define CY_CAPSENSE_VREF_RANGE_1                            (2200u)
    #define CY_CAPSENSE_VREF_VALUE_0                            (2133u)
    #define CY_CAPSENSE_VREF_VALUE_1                            (1600u)
    #define CY_CAPSENSE_VREF_VALUE_MIN_SRSS                     (1164u)
    #define CY_CAPSENSE_VREF_VALUE_MIN_PASS                     (1200u)
#endif

#if (CY_CAPSENSE_DISABLE == CY_CAPSENSE_USE_CAPTURE)
    const cy_stc_csd_config_t cy_capsense_csdCfg = CY_CAPSENSE_CSD_CONFIG_DEFAULT;
#endif

/*******************************************************************************
* Function Name: Cy_CapSense_IsBusy_V2
****************************************************************************//**
*
* This function returns a status of the CAPSENSE&trade; middleware whether a scan is
* currently in progress or not.
*
* If the middleware is busy, a new scan or setup widgets should not be initiated.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the middleware:
* - CY_CAPSENSE_NOT_BUSY    - No scan is in progress and a next scan
*                             can be initiated.
* - CY_CAPSENSE_BUSY        - The previously initiated scan is in progress.
*
*******************************************************************************/
uint32_t Cy_CapSense_IsBusy_V2(const cy_stc_capsense_context_t * context)
{
    return (context->ptrCommonContext->status & CY_CAPSENSE_BUSY);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetBusyFlags
****************************************************************************//**
*
* Sets BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application program.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetBusyFlags(cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->status |= CY_CAPSENSE_BUSY;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ClrBusyFlags
****************************************************************************//**
*
* Clears BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from
* the application program.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ClrBusyFlags(cy_stc_capsense_context_t * context)
{
    /* Clear busy flag */
    context->ptrCommonContext->status &= (uint32_t)(~((uint32_t)CY_CAPSENSE_BUSY));
    context->ptrActiveScanSns->scanScope = CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS;

    /* Mark completion of scan cycle */
    context->ptrCommonContext->scanCounter++;

