RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v2.c
    return (widgetStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanExt
****************************************************************************//**
*
* Starts a conversion on the pre-configured sensor. This function requires
* using the Cy_CapSense_SetupWidgetExt() function to set up the a
* widget.
*
* This function performs single scanning of one sensor in the widget configured
* by the Cy_CapSense_SetupWidgetExt() function.
*
* Calling this function directly from the application program is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time or pipeline scanning, for example).
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status.
*
* The sensor must be pre-configured by using the
* Cy_CapSense_SetupWidgetExt() prior to calling this function.
* The sensor remains ready for the next scan if a previous scan was triggered
* by using the Cy_CapSense_ScanExt() function. In this case, calling
* Cy_CapSense_SetupWidgetExt() is not required every time before the
* Cy_CapSense_ScanExt() function. If a previous scan was triggered in
* any other way - Cy_CapSense_Scan(), Cy_CapSense_ScanAllWidgets(), or
* Cy_CapSense_RunTuner() - (see the Cy_CapSense_RunTuner() function
* description for more details), the sensor must be pre-configured again by
* using the Cy_CapSense_SetupWidgetExt() prior to calling the
* Cy_CapSense_ScanExt() function.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanExt(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t scanStatus = CY_CAPSENSE_STATUS_SUCCESS;

    if (CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(context))
    {
        /* Previous widget is being scanned. Return error. */
        scanStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    }
    else
    {
        /* Check widget sensing method and call appropriate functions */
        switch(context->ptrActiveScanSns->ptrWdConfig->senseMethod)
        {
            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN)
                case CY_CAPSENSE_CSD_GROUP:
                    Cy_CapSense_CSDScanExt(context);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_EN) */

            #if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN)
                case CY_CAPSENSE_CSX_GROUP:
                    Cy_CapSense_CSXScanExt(context);
                    break;
            #endif /* (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_EN) */

            default:
                scanStatus = CY_CAPSENSE_STATUS_UNKNOWN;
                break;
        }
    }
    return (scanStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanSensor_V2
****************************************************************************//**
*
* Starts a conversion on the specified sensor.
*
* Calling this function directly from the application program is not
* recommended. This function is used to implement only the user's specific
* use cases (for faster execution time or pipeline scanning, for example).
* This function is called when no scanning is in progress. I.e.
* Cy_CapSense_IsBusy() returns a non-busy status.
* If the widget is already configured by previous call of this function, the
* widget re-configuration is skipped.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the
* sensor ID within a specified widget can be found in the cycfg_capsense.h
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanSensor_V2(
                uint32_t widgetId,
                uint32_t sensorId,
                cy_stc_capsense_context_t * context)
{
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    cy_capsense_status_t scanStatus = CY_CAPSENSE_STATUS_SUCCESS;

    if (CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(context))
    {
        /* Previous widget is being scanned. Return error. */
        scanStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    }
    else
    {
        if ((ptrActive->widgetIndex != (uint8_t)widgetId) ||
            (ptrActive->sensorIndex != (uint8_t)sensorId) ||
            (ptrActive->currentSenseMethod != context->ptrWdConfig[widgetId].senseMethod) ||
            (ptrActive->connectedSnsState != CY_CAPSENSE_SNS_CONNECTED))
        {
            scanStatus = Cy_CapSense_SetupWidgetExt(widgetId, sensorId, context);
        }
        if (CY_CAPSENSE_STATUS_SUCCESS == scanStatus)
        {
            scanStatus = Cy_CapSense_ScanExt(context);
        }
    }
    return (scanStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_ScanAllWidgets_V2
****************************************************************************//**
*
* Initiates scanning of all enabled widgets (and sensors) in the project.
*
* The tasks of both Cy_CapSense_SetupWidget() and Cy_CapSense_Scan() functions
* are executed by this function. The status of a sensor scan must be checked
* using the Cy_CapSense_IsBusy() prior to starting the next scan or setting
* up another widget.
*
* This function initiates a scan only for the first sensor in the first widget
* and then exits the function. The scan for the remaining sensors are initiated
* in the interrupt service routine (part of middleware) triggered at the end
* of each scan completion. Hence, the status of the current scan should be
* checked using the Cy_CapSense_IsBusy() and wait until all scans is finished
* prior to starting a next scan or initializing another widget.
*
* \note
* This function is available only for the fourth-generation CAPSENSE&trade;.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - Scanning is successfully started.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - All the widgets are disabled.
* - CY_CAPSENSE_STATUS_INVALID_STATE - The previous scanning is not completed and the
*                          CSD HW block is busy.
* - CY_CAPSENSE_STATUS_UNKNOWN       - There are unknown errors.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_ScanAllWidgets_V2(cy_stc_capsense_context_t * context)
{
    uint32_t wdgtIndex;
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    cy_capsense_status_t scanStatus = CY_CAPSENSE_STATUS_UNKNOWN;

    if (CY_CAPSENSE_BUSY == Cy_CapSense_IsBusy(context))
    {
        /* Previous widget is being scanned. Return error. */
        scanStatus = CY_CAPSENSE_STATUS_INVALID_STATE;
    }
    else
    {
        /*
        * Set up first widget. If widget returned error,
        * set up next, continue same until widget does not return error.
        */
        for (wdgtIndex = 0u; wdgtIndex < context->ptrCommonConfig->numWd; wdgtIndex++)
        {
            scanStatus = Cy_CapSense_SetupWidget(wdgtIndex, context);
            if (CY_CAPSENSE_STATUS_SUCCESS == scanStatus)
            {
                ptrActive->scanScope = CY_CAPSENSE_SCAN_SCOPE_ALL_WD_MASK;

                /* Initiate scan and quit loop */
                scanStatus = Cy_CapSense_Scan(context);

                break;
            }
        }
    }

    return (scanStatus);
}


