RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_sensing_v2.c
    return(retVal);
}


/*******************************************************************************
* Function Name: Cy_CapSense_WaitForSeqIdle
****************************************************************************//**
*
* This internal function checks the state of the CSD HW sequencer. If the
* sequencer is switched to the IDLE state before the software timeout,
* the function returns a non-zero. If the software watchdog is triggered
* during the scan, the function returns zero.
*
* \param watchdogCycleNum
* A watchdog cycle number to check a timeout.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watchdog counter. If it is equal to zero, it means timeout happened.
*
*******************************************************************************/
uint32_t Cy_CapSense_WaitForSeqIdle(
         uint32_t watchdogCycleNum,
         const cy_stc_capsense_context_t * context)
{
    uint32_t watchdogCounter = watchdogCycleNum;

    while((0u != (CY_CAPSENSE_CSD_SEQ_START_START_MSK &
        context->ptrCommonConfig->ptrCsdBase->SEQ_START)))
    {
        if(0uL == watchdogCounter)
        {
            break;
        }

        watchdogCounter--;
    }


    return (watchdogCounter);
}


/*******************************************************************************
* Function Name: Cy_CapSense_WaitEndOfScan
****************************************************************************//**
*
* This internal function checks for the scan status. If the scan ends before
* the software watchdog triggering, the function returns a non-zero watchdog
* cycles number. If the software watchdog triggers during the scan,
* the function returns zero.
*
* \param watchdogCycleNum
* A watchdog cycle number to check a timeout.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns watchdog counter. If it is equal to zero, it means timeout happened.
*
*******************************************************************************/
uint32_t Cy_CapSense_WaitEndOfScan(
         uint32_t watchdogCycleNum,
         const cy_stc_capsense_context_t * context)
{
    uint32_t watchdogCounter = watchdogCycleNum;

    while (((context->ptrCommonConfig->ptrCsdBase->INTR &
             CY_CAPSENSE_CSD_INTR_SAMPLE_MSK) == 0u) && (0u != watchdogCounter))
    {
        watchdogCounter--;
    }

    return (watchdogCounter);
}


#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) || \
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateCheck
****************************************************************************//**
*
* Verifies that the calibrated widget meets the configured conditions.
*
* This function checks whether the raw count of each sensor of the specified widget
* is within the raw count range defined by raw count target and +/- calibration
* error.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \param target
* The raw count target in percentage.
*
* \param senseMethod
* The widget sensing method.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_CalibrateCheck(
                uint32_t widgetId,
                uint32_t target,
                uint32_t senseMethod,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t calibrateStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t tmpRawcount;
    uint32_t snsIndex;
    uint32_t upperLimit;
    uint32_t lowerLimit;
    uint8_t calibrationError;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    const cy_stc_capsense_sensor_context_t * ptrChCxt = ptrWdCfg->ptrSnsContext;
    uint32_t freqChIndex;
    const cy_stc_capsense_sensor_context_t * ptrSnsCxt;

    /* Calculate acceptable raw count range based on the resolution, target and error */
    if(CY_CAPSENSE_CSD_GROUP == senseMethod)
    {
        tmpRawcount = (1uL << context->ptrWdContext[widgetId].resolution) - 1u;
        calibrationError = context->ptrCommonConfig->csdCalibrationError;
    }
    else
    {
        tmpRawcount = context->ptrWdContext[widgetId].maxRawCount;
        calibrationError = context->ptrCommonConfig->csxCalibrationError;
    }

    lowerLimit = 0u;

    if (target > calibrationError)
    {
        lowerLimit = target - calibrationError;
    }
    upperLimit = target + calibrationError;
    if (upperLimit > CY_CAPSENSE_PERCENTAGE_100)
    {
        upperLimit = CY_CAPSENSE_PERCENTAGE_100;
    }
    lowerLimit = (tmpRawcount * lowerLimit) / CY_CAPSENSE_PERCENTAGE_100;
    upperLimit = (tmpRawcount * upperLimit) / CY_CAPSENSE_PERCENTAGE_100;

    /* Check whether sensors' rawcount is in the defined range */
    for (freqChIndex = 0u; freqChIndex < CY_CAPSENSE_CONFIGURED_FREQ_NUM; freqChIndex++)
    {
        ptrSnsCxt = ptrChCxt;
        for(snsIndex = 0u; snsIndex < ptrWdCfg->numSns; snsIndex++)
        {
            tmpRawcount = ptrSnsCxt->raw;
            if ((tmpRawcount < lowerLimit) || (tmpRawcount > upperLimit))
            {
                calibrateStatus = CY_CAPSENSE_STATUS_BAD_DATA;
                break;
            }
            ptrSnsCxt++;
        }
        ptrChCxt += context->ptrCommonConfig->numSns;
    }

    return (calibrateStatus);
}
#endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) ||\
           (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN)) */


/*******************************************************************************
* Function Name: Cy_CapSense_GetVrefAutoMv
****************************************************************************//**
*
* Finds the optimal Vref value based on the VDDA voltage.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the recommended reference voltage based on the configuration.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetVrefAutoMv(const cy_stc_capsense_context_t * context)
{
    uint32_t vddaMv = (uint32_t)context->ptrCommonConfig->vdda;
    uint32_t vrefHighVoltageMv;

    #if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
        if(vddaMv >= CY_CAPSENSE_VREF_RANGE_0)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_0;
        }
        else if(vddaMv >= CY_CAPSENSE_VREF_RANGE_1)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_1;
        }
        else if(vddaMv >= CY_CAPSENSE_VREF_RANGE_2)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_2;
        }
        else
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_MIN;
        }
    #else
        if(vddaMv >= CY_CAPSENSE_VREF_RANGE_0)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_0;
        }
        else if(vddaMv >= CY_CAPSENSE_VREF_RANGE_1)
        {
            vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_1;
        }
        else
        {
            if (CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
            {
                vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_MIN_PASS;
            }
            else
            {
                vrefHighVoltageMv = CY_CAPSENSE_VREF_VALUE_MIN_SRSS;
            }
        }
    #endif

    return(vrefHighVoltageMv);
}


